Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] KO>EN The Final Raid Boss TM.tmx
Source language: ko_kr
Languages: en

source: 기다리고 있겠습니다
en: we will wait for you.

source: 뭐 대단한 거 한다고..
en: dude, chill...

source: 칭호
en: title

source: 파직
en: bzzt

source: 기억하고 싶지 않습니다ꞏꞏꞏ
en: I don’t want to talk about it...

source: 룬석에 저장된 장소로 순간이동한다.
en: ability to move to distant places that stores this runestone

source: 번쩍-!
en: beam

source: 스윽
en: ssk

source: 펑!
en: pow

source: [점프]
en: [jump]

source: 카아악!!
en: kraah!!

source: 스토리 관련 오류 발생!
en: a story-related error has occurred!

source: 걱정 마.
en: don’t worry.

source: 타인이 스킬이나 공개 요청을 통해 스탯창을 확인할 경우 전투력만 공개됩니다.
en: only combat power will be displayed if another user checks the status window via a skill or reveal quest.

source: 너다!!!
en: ...is you!!!

source: 개 먹기 싫게 생겼다..
en: it really doesn’t look appetizing...

source: 지잉!
en: shing

source: 여긴 이 관이랑 단상만 빼고 다 가상공간처럼 해놔서..
en: but this place looks like virtual reality except for this casket and platform...

source: [마왕군의 던전을 만들어라!]
en: [build a dungeon for the demon corps]

source: 아니 게이머라면 가장 심각한 상황이라고 할 수 있어
en: ...or a gamer, there’s always a way out even in worst case scenarios.

source: 연봉도 엄청 올랐다는 썰이⋯
en: I heard that the salary has significantly increased...

source: 팔랑
en: flip

source: 기본 스탯에 가중치를 설정하여 경험치 배분을 정할 수 있습니다.
en: you can determine the distribution of experience points by setting weights in the basic stats.

source: 최종보스 공대장
en: the final raid boss

source: 컥!
en: ugh!

source: 철컥
en: clack

source: 18:00 정상
en: 18:00 normal

source: 확실히 센스가 있어
en: ... you'll see he has a knack for this.

source: 근데..
en: so...

source: 위치 보낼 테니까 합류해!
en: I’ll send you the location. join us!

source: 일반 병사로 숨어들어야 해서 마법으로 바꿨습니다
en: my magic changed since I had to hide as a regular soldier.

source: 폴짝
en: hop

source: 게임에서 죽으면 현실에서도 죽을 수도 있게 만든 주제에
en: you even made it so that I die in the real world if I die in the game.

source: 슥
en: swish

source: 왕국 이벤트가 발생하였습니다.
en: a kingdom event has occurred.

source: 탁 탁
en: brush brush

source: 이럴 줄 알았어..
en: I knew it.

source: 도대체 뭐가 있길래∙∙∙
en: what are you looking at...?

source: 왜 치료를 안 해주시나..
en: I was wondering why you weren’t trying to heal me...

source: [국왕 죽음의 비밀]
en: [the truth of the king’s death]

source: 호위대장과 타, 토, 지니는
en: commander, tar, to, genie...

source: 잠..{j}잠깐!
en: w-wait!

source: 움찔!
en: jolt

source: 쉬익
en: swish

source: 보상 아이템을 선택하십시오.
en: choose a reward item.

source: 탁!
en: tap

source: 가장 큰 위기다
en: is the biggest problem

source: 마왕자의 스킬로 생성된 환영들
en: hallucinations created by the demon prince’s skill

source: *기사단 소속만 착용 가능 *주위에 백곰기사단이 있을 경우 공격력 버프 효과
en: *can only be worn by knights *gives buff effect if the white bear knights are around

source: 소인배인 아서 녀석이 암살 시도를 할 리가 없지..
en: of course, a coward like arthur wouldn’t make such an assassination attempt...

source: 쿠구구…
en: krrrk

source: 알겠지?
en: understood?

source: 딱 봐도 돈 복사 사기나 치고 다니게 생겨가지고
en: I can tell that you’re a scammer with one glance.

source: 파지직
en: pzzt

source: 충전형 아이템(최대 3개)
en: rechargeable item (up to 3 items)

source: 땡 강
en: CLANG

source: 잘 봐.
en: look.

source: 미확인 몬스터들이
en: the unregistered monsters...

source: 퍼엉!!
en: boom

source: 하찮은 것들끼리 놀아ㅋ
en: go play with your useless friends, haha!

source: 콰칭!!
en: kaching

source: 아직 어리니까 마왕은 아닌가..?
en: is he not the demon king yet, since he’s still young...?

source: 고생했어!
en: good work!

source: 그냥 근돼가 아니야!
en: he’s not just muscular!

source: 유저 평균에 맞게 자동으로 레벨을 조정합니다.
en: the level will automatically be adjusted according to the player's average stat.

source: 어디서 이미 줘터지고 왔네
en: ...but it looks like you've already been beaten up.

source: 만약에 대장 오빠가 돌아와서
en: what are you gonna do...

source: 흑마법입니다!
en: it’s black magic!

source: 이번 미션은 건축인가?
en: I guess my mission this time around is about architecture?

source: 배싱 당한 이후로 이날만을 기대하며 살아왔네
en: I’ve been awaiting this very day after getting betrayed.

source: 스르륵
en: softy

source: [마왕자를 치료해라!]
en: [heal the demon prince!]

source: 시간이 촉박해 자세한 설명은 그대들 대답을 듣고 하도록 하지
en: since we’re running out of time, you can get more details from the white bear knights.

source: 없음
en: n/a

source: 글 김장훈
en: story janghun kim

source: NPC면 '영혼 수집가' 세트템일 것 같은데
en: and the npc one would likely be a “soul collector’s item set”...

source: 둥
en: rumble

source: 저벅
en: step

source: 콰앙
en: boom

source: 아이템 등급 :
en: item grade:

source: 최대한 빨리 성문을 개방해야 할 것 같습니다.
en: we’ll have to open the gate as soon as possible.

source: [공대장씨 사망 시 게임 지속 불가]
en: [the raid boss will be unable to continue the game due to his death]

source: 여기도 있었지···?
en: there’s another one here...?

source: [길드 퀘스트 본선 1라운드]
en: [guild quest final round 1]

source: 도전 정신!{j}멋!
en: let’s do this, for style!

source: 간결한 움직임ꞏꞏꞏ
en: the light moves...

source: 촤아아
en: swoosh

source: 탭탭
en: tap tap

source: 룬 스킬 [점프]
en: rune skilll [jump]

source: 착용하고 있는 것만으로도
en: as long as you wear it

source: 인간 싫다면서 왜 꽝꽝이 갖고 ㅈㄹ이야!
en: why are you hurting squeaker if you think humans are the worst?!

source: 풀은 불에 약하니까 혹시나 독성이 있어도 사라질 거란 말씀!
en: since plants are weak to heat, I’m sure the fire will eliminate any possible poison!

source: 이거였어
en: it was this.

source: 스승
en: swoosh

source: 그럼 빨리 썻으면 됐잖아ꞏꞏꞏ
en: then why didn’t you use that already...?!

source: 꽝.{j}꽝∙∙∙ (이등병.{j}잘 가라꽝..)
en: squeak, squeak... (good bye, soldier...)

source: 가까운 거리를 순간이동한다.
en: ability to move to nearby places instantly.

source: 키가 짧아 말이 짤림
en: his voice got cut off because he’s short

source: 내 게임 인생의 은인들!
en: the biggest contributors to my gaming career!

source: 꽈으응...
en: squeee...

source: 호위대장을 여기로 불러야겠어
en: we’ll have to call the commander of the guards here.

source: 탁 오빠를 막을 수 있을까?
en: do you think we can stop tak?

source: 파직!
en: pzzt

source: 꽈득
en: grab

source: 꽈아앙! (조각성 봐라!{j}니가 시켰잖슴!
en: {j}squeaak! (look at the sculpture! you told us to make it!)

source: [욕망의 짐승]
en: [Beast of Desire]

source: 마무리 짓고 직접 물어보시죠..!
en: you should ask him yourself after wrapping it up!

source: 룬 스킬
en: rune skill

source: [듀얼 캐스팅]
en: [dual casting]

source: 두둥 둥좡
en: ba dun

source: 띡!
en: beep

source: 윽
en: oosh

source: 게임 속이라 자연스러워서 중요한 걸 놓치고 있었네?
en: I was missing something important because it looked so natural in the game.

source: -현재 소환수 (3/5)
en: - current number of summons (3/5)

source: 서큐버스가 없었으면 큰일 날 뻔 했네
en: it could’ve been really bad if we didn’t have succubus.

source: 불리하니까 말 못 하는 척하네?
en: look at you suddenly pretending like you can’t talk.

source: (이제 좀 쓸만하구만!!)
en: (you’ve all become just a little useful now!!!)

source: 스킬을 쓰려고 멈칫하는 순간에
en: The moment you stop using your skill...

source: 성큼
en: stride

source: 대규모 패치가
en: will have a massive

source: 여기에 뭔가 있는 건가?
en: maybe there’s something here?

source: 꽝!
en: yes, sir!

source: 앗!
en: oh!

source: 공대장씨 관련된 직원들과 유지 보수 팀 직원 한 명 포함해서
en: include a staff member from the maintenance team...

source: [썬더스트로크]
en: [thunder stroke]

source: 흑마법 같은 건가?
en: is it similar to dark magic?

source: 모두 퇴군하라!
en: everyone, back off!

source: 팽{j}그{j}르{j}르
en: RUM{j}M{j}M{j}BLE

source: 부들
en: tremble

source: 부스럭..
en: rustle

source: 이건 뭐 특별히 쓸 일도 없어 보이는데 왜 준 거야
en: I don’t understand why they gave me this. it seems useless.

source: 콰직
en: smash

source: 선택에 따라 기존 임무가 업데이트됩니다.
en: the next mission will be updated according to your selection.

source: 이대로 정말 죽는구나..{j}싶었는데..
en: I thought I was really going to die like this...

source: 꾸라라
en: rumble

source: 명성이 높은 상대에게 무시당합니다.
en: you will be ignored by opponents with a high reputation.

source: 마법석 세 종류를 조합해도 되는 거겠지?
en: I can combine three of the magic stones, right?

source: 넌 어떻게 생각해?
en: what do you think?

source: 실종됐습니다.
en: ...went missing.

source: 꽈드드득
en: krrrck

source: 쉬이익
en: shwoo

source: 얘 왜 이래?
en: what’s with him?

source: 마왕자에게 '악한 마음' 전수하라!
en: pass on your “evil ways” to the demon prince!

source: 보스를 소환합니다.
en: the boss has appeared.

source: 특수 지역에 진입했습니다.
en: you have entered a special area.

source: 몬스터한테 한방 컷 당한 주제에..
en: I mean, you got knocked out by a monster in just one attack...

source: 뚝 ㅡ
en: beep

source: 어휴..
en: oh my...

source: 우리 길드를 건드리면
en: this is what you get...

source: 국경수비대장이 반역자인 것 같습니다
en: ... the commander of the knights of the border defense is the traitor.

source: 임무완료 보상이 지급됩니다.
en: the quest has been completed and a reward will be given.

source: 반역자!
en: the traitor!

source: 맞아ㅋㅋㅋㅋ
en: yup, that’s right! haha.

source: 혼내주고 싶은걸?
en: it sounds like you’re asking for a beating.

source: 이야∙∙∙ 멀쩡하네?!
en: wow... it was very well kept!

source: 버둥 버둥
en: wriggle wriggle

source: 뭐지 저건?
en: hm? what’s that?

source: 화르르...
en: fwoom

source: 맷집도 보스급 맞고
en: your endurance isn’t high enough to be a boss.

source: 띠링
en: ding

source: 여길 벌써..?!
en: he’s already here...?!

source: 아⋯ 아니⋯ 어떻게 여기에⋯
en: ah... but... how did you get here...

source: 회장실
en: president’s room

source: 너무 기괴해서 폐기된 건가?
en: was it abandoned because it was too bizarre?

source: 콰과과과
en: krrkrrrk

source: 그럼 니가 저거 맡아!
en: you take that guy then!

source: 지금까지 고생한 두 길드 대표의 노로를 치하하기 위해 투기 대화를 관리한 호위대장이 왕궁으로 초대했습니다.
en: the manager of the competition and commander of the guards has invited both representatives of the two guilds to the royal palace to reward them for their hard work thus far.

source: 속닥 속닥
en: whisper whisper

source: 무엇이든 씻어낼 수 있다.
en: it can be used to wash anything.

source: 뿔 꼬마가 함정 설치하러 갔는데
en: the kid with horns went to set up traps

source: 원래 아서의 모습인가..
en: is that what arthur originally looked like...?

source: 내 부하가 돼라
en: ...will serve me.

source: 맘에 안 들어ꞏꞏꞏ?
en: you don’t like it?

source: 뭐 특이사항 없었어?
en: was there anything out of the ordinary?

source: 미안하다 꽝꽝아···
en: I’m sorry, kkwang kkwang...

source: 여기 벽 좀 파자!
en: let’s dig this wall!

source: 내가 먼저 공격했는데도 막혔어
en: I attacked him first, but he countered it.

source: 아직 멀었다 자식아!
en: dude, you still have a long way to go!

source: 강한 힘을 빌려주었지
en: as if he already knew everything.

source: 아니?
en: nope!

source: 삐질
en: plip

source: 이 은혜 평생 잊지 않겠습니다!
en: I will never ever forget your help!

source: 오
en: oh

source: 부웅
en: rumble

source: 그래서ꞏꞏꞏ
en: so...

source: 계급 이름을 뭐로 하지⋯?
en: what name should I use for this class?

source: 와르르...
en: rumble

source: 빠지직
en: pzzt

source: KO
en: EN

source: 아서 왕국 마지막 소환사인 피나의 벨트.
en: fina’s belt is the last summons item in arthur kingdom.

source: 시끄럽고!
en: shut up!

source: 플리커 전용 스킬 [갸르드]
en: flicker’s special skill [en garde]

source: 그렇게 하는 거 아닌데∙∙∙
en: that’s now how you do it...

source: 히든 미션 포함 3개 달성
en: accomplish three hidden missions

source: 쉬{j}이{j}익
en: f{j}la{j}sh

source: 뚝딱
en: clang

source: 꽝꽝!!
en: squeak squeak!!!

source: 정말 대책이 없는 사람이군!
en: you’re really clueless, aren’t you?!

source: 길드장들은 왜?
en: why are you meeting with guild leaders?

source: (단, 본인 사용 불가)
en: (cannot be used on one’s self)

source: 그렇다면 여기는 몬스터들에게 아이템을 바치던 곳이거나
en: this must be a place where she used to sacrifice items to monsters

source: 아!
en: ah!

source: 톡톡히 치르게 해주마!!
en: ... I’ll make sure that you pay for it!

source: 와아아...
en: WAHHH

source: 그래도 학생들이라 천만다행이야
en: thank god, they are just teenagers.

source: 여태 미션이 생성되지 않은 게 놀리려고 그런 게 아니었어⋯!
en: the mission that didn’t appear wasn’t actually trying to mess around with me...!

source: 그..
en: a-about

source: 꽝꽝? (은인이라면서 왜 패냐꽝?)
en: squeak squeak! (why would you attack them then?)

source: 해찬이 얘는 왜 안 와?
en: why isn’t haechan here yet?

source: 세상진지
en: super serious

source: 헬라임군
en: mr. arnold.

source: 여기 말곤 건물 자체에 특별한 건 없단 말이지
en: nothing seems special about this building.

source: 상대 마법 공격의 75%를 흡수하여 다음 공격에 추가한다.
en: it absorbs 75% of the opponent’s magic attack and adds it to the next attack.

source: (근력+무게)
en: (strength + weight)

source: 콰아아
en: kaboom

source: 푹 빠져있지
en: ...fallen for me, haven’t you?

source: 뚜두둑
en: crackle

source: 이것이 운동의 맛인가ꞏꞏꞏ !
en: so this is what working out feels like...!

source: 찰팍! (이건 유연한 근육..{j}연근이다!)
en: glub! (this is flexible muscle... flexicle!)

source: 실패 시 다음 역할에 페널티 부여.
en: a penalty will be given to the next role.

source: 야 이새기야!
en: this b*stard!

source: 타가각
en: tap tap

source: 헤인⋯
en: hein...

source: 포장이 귀찮긴 해
en: gift wrapping is definitely a hassle.

source: 아..
en: oh...

source: 크{j}르{j}르
en: gr{j}o{j}wl

source: 첫 번째 이벤트로 기록하시겠습니까?
en: would you like to record your first event?

source: 꽝꽝!
en: squeak squeak!

source: 상대가 제시간에 도착하지 않아
en: if the opponent doesn’t arrive on time,

source: 19:00 정산
en: 19:00 normal

source: 이름하여
en: in the name of...

source: 두 가지 스킬을 동시에 발동할 수 있다.
en: you can use two skills at the same time.

source: 백곰기사단장이 되면 하사받는 상의와 하의가 연결된 한 벌 갑옷.
en: * defense buff effect if the commander of the white bear knights is around

source: 화장실 앞에⋯ 공대장씨 전담⋯
en: right in front of the president’s room... dedicated to the raid boss...

source: 띠링!
en: ding

source: 타악
en: tat

source: 쿨타임 기다리는 중
en: waiting for cooldown time

source: 감사합니다!
en: thank you!

source: 탁드립니다
en: a new mission has been created

source: 이거 성능 엄청 좋잖아 이런 장비를 공짜로 주는데 그게 복지고 그게 꿀이지
en: this uniform has really good performance. giving out equipment like this for free is an amazing perk.

source: 쉬우우웅
en: shooom

source: 티잉
en: ting

source: 저벅...
en: tap

source: 으-
en: ugh...

source: 몬스터 악명은 '악한 마음' 때문에 생긴 건가?
en: did I obtain monster reputation because of my “evil ways”?

source: 콜라..{j}아니 아서는?
en: {j}where’s cola... no, arthur?

source: 부활목 묶음
en: resurrection tree bundle

source: 근육과 지방을 순식간에 키워내 폭발적인 힘을 낸다.
en: instantly increases muscle and fat, allowing for more explosive power.

source: 생각보다 더 빠르다
en: it’s faster than I thought.

source: 오류 보고서
en: error report

source: 음....
en: hmm...

source: 이게 무슨 소리..
en: what’s this noise?

source: 짤랑
en: clink

source: 옅고 작은
en: darkness

source: 달 달
en: wheeze wheeze

source: 미확인 몬스터들이 왕궁을 습격하고 있습니다!
en: unregistered monsters are attacking the palace right now!

source: 경험치 없이 강해지라고?
en: are you telling me to get stronger without exp?

source: 이거나 먹어라!
en: take this, you f*cker!

source: 달칵
en: clack

source: 콰과
en: rumble

source: 그냥 슬라임이 아니라 근육질 슬라임이었어!
en: it wasn’t just a regular slime. it was a super muscular slime!

source: 갑옷이었던 것..
en: what was previously his armor...

source: 대장 오빠 오류 노트..?
en: the boss’s error report...?

source: 여기가 끝인 거 같은데ꞏꞏꞏ
en: it looks like this is the end...

source: 빨리 하던 얘기마저 해
en: c’mon, hurry up and tell me about it!

source: 맞네..
en: oh, it is a casket...

source: 꽝꽝.. (창작의 고통이다꽝..)
en: squeak squeak... (I got artist’s block...)

source: [얼음과 불의 노래]
en: [song of ice and fire]

source: 근데
en: but...

source: 왕국 퀘스트는 길드 이름 가져간 성수중일짱이랑 같이 움직인다고?!
en: and now the kingdom’s quests requires us to work with "sungsoo is the best", the very b*stard who stole our guild’s name?!

source: 툭
en: tap

source: 게이머들 기피 1순위 함정까지!
en: ...and traps that gamers hate the most!

source: 슈우웅
en: shwoo

source: 기억만 간직한 곳에 온 것을 환영한다!
en: welcome to the place where only memory exists.

source: E등급
en: E

source: 어떻게 할 거지?
en: what are you gonna do?

source: 디버프 :
en: debuff:

source: 띠용
en: boing

source: 게임 안에서ꞏꞏꞏ 공대장씨가ꞏꞏꞏ
en: in the game... mr. raid boss...

source: 저항 +18
en: resistance +18

source: 쉬{j}이{j}이{j}익
en: f{j}l{j}a{j}sh

source: 두두두두
en: tap tap tap

source: (무기도 없는데 어떻게하냐꽝?)
en: squeak squeak! (we don’t even have weapons!)

source: 지직
en: bzzt

source: 텅!!
en: tump

source: 저게 있는 한ꞏꞏꞏ
en: if she stays here...

source: 내가 원하는 건 이게 아니야..!
en: ...this isn’t what I want!

source: 콜라의 속성이 '경계인'으로 변경되었습니다.
en: cola’s attribute has been changed to "borderliner."

source: 위잉
en: brrh

source: 오?!
en: oh?!

source: 푸 카 칵!
en: bang

source: 두 길드를 백곰과 흑호 이어 3번째 기사단으로 편성하겠네
en: following the white bear and the black tiger, the two winning guilds will become the third order of knights.

source: 성수중일짱 쟤도 만만치 않은 것 같아
en: that seongsu is the best guy is pretty formidable, too.

source: 타다다!
en: tap tap tap

source: 아이템을 사용할 수 없습니다.
en: you cannot use the item.

source: 엄근
en: super serious

source: 찰팍.
en: glub.

source: 나랑 붙기만 해봐!
en: just wait till I catch him!

source: 내가 쓸 수 있는 방법은 없어?
en: is there any way I can use it?

source: 네깟 것들에겐 과분할 게야
en: it’ll still be way too good for you bastards.

source: 이걸 지키기 위해선..{j}어쩔 수 없지..
en: but I have no other choice to keep this safe...

source: 아무리 상성이 안 좋았다고 해도 ABC 길드장 상대하는 거 보면
en: ... if you look at how he measures up against the abc guild leader, no matter how bad the match is...

source: 공대장씨 목격 글, 제보 글 모두 원상복구하고
en: restore all the posts about mr. raid leader right now,

source: 성수중일짱 전용 스킬 [킹갓엠퍼러우젤멋 스파이럴앤드릴앤슬래시!!!!]
en: middleschoolthug’s special skill [king god imperial style spiral slash!!!]

source: 타 악!
en: tat

source: 입도 뻥긋 못하게 해주겠어!
en: ...open your mouth to talk again!

source: 알아서 해
en: do what you want.

source: 어떻게 말인가?
en: how so?

source: 만드라고라 밭은 좀 이르지만..
en: it’s a little too soon for a mandrake farm...

source: 마왕자와 서큐버스의 친밀도가 최대치가 됩니다.
en: the intimacy level between the demon prince and succubus has reached the maximum.

source: 갓챠
en: gotcha

source: 그래!{j}이렇게 보고하는 거야!!
en: yes! that’s what I should report!

source: 그래서 머리도 짧게 친 거지?
en: that’s also why you cut your hair short, right?

source: 쿠구구
en: krrk

source: 퀘스트 제한 시간 3분
en: quest time remaining: 3 minutes

source: 역사적 몬스터의 주인
en: master of historical monsters

source: 어차피 뭘 선택해도 날 이용해먹겠다는 거잖아?
en: no matter which one I choose, I'll be taken advantage of, won’t I?

source: 몬스터의 핏줄을 조지러 간다!
en: ...we’ll go wipe out the monster’s bloodline!

source: 진짜 영영 잠든 곳이었어?
en: ...was really where they went to sleep forever?!

source: 콰아앙
en: wham

source: 지글 지글
en: sizzle sizzle

source: 여기서 기다리면 범인이 올지도..!!
en: the criminal might really return if we wait here!

source: 이번엔 몰이사냥이야 너만 믿는다.{j}공꽝꽝!
en: we’ll horde hunt this time. I leave it all to you, squeak boss!{j}

source: 하..ㅈㄴ멋있었어..
en: ha... that was so f*cking cool...

source: 몬스터 장비면 '마왕군 전투복'정도 될거고
en: the monster equipment would be a “demon corps uniform,”

source: 푹
en: shlk

source: "아이템 생성은 쉽지만 삭제는 아니란다"라고 누가 말했더라??
en: who was it that said “creating items is easy but deleting them isn’t”??

source: 히잉구
en: whimper

source: 성능은 마왕군 전투복이 좋았단 말이지..
en: but the demon corps uniform had a much better performance...

source: [오러 시프트]
en: [aura shift]

source: 걍 창고로 써야겠다!
en: ...I should just use it as storage!

source: 룬석..?
en: runestone...?

source: [지니]
en: [genie]

source: 콰아 아아
en: bwoom

source: 찰팍..
en: glub...

source: 아ꞏꞏꞏ 아니?!
en: w-wait...

source: 그렇다면 내가 게임에 갇힌 게
en: then this means...

source: 고맙다!
en: thanks!

source: 결국 최종보스 길드랑도 기사단으로 엮이고 말야
en: in the end, we’ve all been appointed as knights with the final boss guild.

source: 반역자는 너고 이 자식아
en: you are the traitor, not me.

source: 치지짓
en: pzzzt

source: 공대장
en: raid boss

source: 걱정 말고!
en: don’t worry. I got you!

source: 설마..
en: wait...

source: 꽝꽝! (내가 없었음 어쩔 뻔했냐꽝!)
en: squeak squeak? (what are you gonna do without me?)

source: ㅂㄷㅂㄷ
en: bow bow

source: 타악!
en: snatch

source: 잠깐은 무슨!{j}팍씨! (꽝!꽝!)
en: squeak squeak! (hey, shut your mouth!)

source: 근거리 공격을 막아낼 수 있다.
en: it can block close-range attacks.

source: 근처에 있는 길드원들 더 부를까?
en: should I call other guild members nearby?

source: 그러고 보니 인간치고 익숙한 느낌...
en: come to think of it, he seems familiar...

source: 찰팍.. (쓸모 없는 녀석이군..{j}이란 뜻)
en: glub... (what a useless man...){j}

source: 우리 한 번만 더 신고 먹으면 일주일 정지야!
en: if someone reports us one more time, we’ll be banned for a week!

source: 제한 시간 10분 안에 마왕자를 치료하라.
en: heal the demon prince within 10 minutes.

source: 딱 한 가지만 빼고
en: except one thing.

source: 파 스스...
en: fizzz

source: 어쩌면 AI가 공대장씨를 이용하고 있는 걸 수도ꞏꞏꞏ!
en: perhaps, the ai is using him?!

source: 내가 아무리 게임에 미친놈이라고 해도
en: no matter how much of a game fanatic I am,

source: 최종보스
en: the final

source: 호위대장님이 호출하셔서 지금은 어려울 것 같습니다..
en: I can’t right now. the commander of the guards called me.

source: 커뮤니티 쪽은 아무래도..
en: but the problem is other online communities...

source: 일단 막자!
en: let’s block it for now!

source: 부러워도 어쩔 수 없는 것이다!
en: envious as you may be, this is pre-destined!

source: 그거 아니야ꞏꞏꞏ
en: you’ve got it wrong...

source: 스
en: sw

source: 아스트롬에 갇히고
en: getting stuck in astrom

source: 그럼 '마계의 힘'이 뭔지 알아?
en: then, do you know what the “demonic power” is?

source: 현재는 병력 편성과
en: currently, only troop organization

source: 사람들이 싫어하는 등산에 미로..
en: maze and hiking trails that people don’t like...

source: 근데 보기 싫게 이건 뭐야?
en: by the way, what’s this thing in the middle of the way?

source: 마왕자가 직접 하사한 '마왕군의 상징'이 착용자의 현재 능력치를 토대로 갑옷 형태로 변형됐다.
en: the “emblem of the demon corps”, granted by the demon prince himself, has transformed into armor based on the current stats of the wearer.

source: 뭐지?
en: huh?

source: 쭈구리 앉은 채로 기세를 뿜어낸다.
en: sit back and show off one’s energy.

source: 관리를 잘해 상태가 좋다.
en: it is well-maintained and in good condition.

source: 촤악!
en: fwip

source: 물론!
en: of course!

source: 탁 오빠 성격 생각하면 이제 시작일 것 같은뎀...
en: knowing tak, this is just the beginning...

source: 더러운 짓거리는 다하면서 말이야∙∙∙
en: but do all kinds of nasty things behind...

source: 나를 파괴하고 파수꾼의 의지를 계승하∙∙∙
en: destroy me and succeed the watchman’s will...

source: 콰앙!!
en: wham

source: 치지직
en: sizzle

source: 멈 칫
en: halt

source: 까득
en: GRIT

source: S 원하는 착용 아이템으로 변형할 수 있다.
en: it can be transformed into any wearable item.

source: 잠깐!
en: wait!

source: 뭐 아무것도 안 해?!
en: you’re not gonna do anything?!

source: 이거 치워바!
en: move this stone!

source: 지이이이
en: whirrr

source: 웅!!
en: ash!!!

source: 당장 백곰기사단에 복귀해 지금 하는 말을 전하도록!
en: go back to the white bear knights at once and report the situation to them!

source: 모르는구만
en: so you don’t know...

source: 꽈광~ (채색 간단해졌다꽝)
en: squeak! (the coloring is gonna be easier)

source: 크억!!
en: argh!!

source: 현존하는 던전 난이도 최고 등급(S)를 넘어섰습니다.
en: the highest dungeon difficulty level(s) has been exceeded.

source: 인기 없던 던전이라 사람들은 잘 모르지만
en: since this isn’t a popular dungeon, many people don’t know about it.

source: 피나의 벨트
en: fina’s belt

source: 국경 수비로 시작해서
en: they’ve been like that ever since the border defense mission.

source: 정말 감사합니다∙∙∙
en: thank you so much...

source: 꾸라라 꾸라라!
en: grumble grumble

source: 어린아이도 죄책감 없이 때리는 무자비함..!
en: that mercilessness of hitting a child with no sense of guilt!

source: 아이템은 제대로 만들어졌는데 방금 폭발은 뭐였지?
en: although the item has been made successfully, what was that explosion?

source: 빵긋
en: smile

source: 쿠웅
en: thump

source: 꽝꽝? (수련하러 왔냐꽝?)
en: squeak squeak? (are you here to train or something?)

source: [중력검]
en: [gravity sword]

source: 좌
en: SLASH

source: 틱
en: tap

source: 수{j}숭{j}숭
en: wh{j}oo{j}shhh

source: 21:00 정산
en: 21:00 normal

source: 저기ㄹㅇ 남산 타워 있음!
en: that’s namsan tower right over there!

source: 쾅..?!!
en: boom...?!!

source: 던전 공략하고 가자
en: ...let’s clear the dungeon.

source: 아무리 운이 좋았다고 해도 결승까지 갈 줄이야!
en: I don’t care if it’s just by luck, but our guild master made it to the finals!

source: 헐..
en: what the...

source: 짝
en: clap

source: 보통 게임이면 장소 자체에 힌트가 있을 텐데
en: if it was a regular game, there would be a clue in the location itself.

source: 마법진 니가 연 거 아니야?
en: you’re the one who opened the magic circle, right?

source: 활동적인 갑옷으로..!
en: into flexible armor...?!

source: -점프(액티브) :
en: jump (active)

source: 별도로 스탯을 부여할 수 없습니다.
en: individual stats cannot be provided.

source: 콰 앙!
en: thump

source: 놀라게 해드려서 죄송합니다.
en: I’m sorry to startle you.

source: 빙글
en: spin

source: 레이드를 갔다고?
en: did you say they went for a raid?

source: 꾸라락!!
en: grara!!

source: 호위대장도 어떻게 해야 할 지 알겠지?
en: ...I hope you behave accordingly, alright?

source: 역할 :
en: role:

source: 단, 3가지 형태만 저장할 수 있다.
en: but only 3 forms can be saved.

source: 선택하라는 거지?
en: between npc and monster?

source: 그..{j}그건..!
en: th-that’s...!

source: 또 일하냐는 뜻
en: "we have more work to do?!"
